{
  "chunk-016a36b967af746fcdce02d11a3eca50": {
    "tokens": 1200,
    "content": "Unbox and Inspect the Phone\nCarefully unbox your new phone and remove any plastic covers, stickers, or \nprotective films from the device. Check if all the necessary accessories are included\n—typically, you should find a charging cable, power adapter, SIM ejector tool, and \ndocumentation such as a user manual or warranty card. If anything is missing, contact\nthe retailer or manufacturer before proceeding. Some phones come with a pre\u0002installed screen protector—if yours does, decide whether to keep it or replace it with \na higher-quality one for better durability and scratch resistance.\nInsert SIM Card and Optional Memory Card\nBefore turning on the phone, locate the SIM card tray, usually found on the side of \nthe device. Use the SIM ejector tool provided in the box, or a paperclip, to open the \ntray. Insert the SIM card in the correct orientation—check the small icon near the tray\nfor guidance. If your phone supports microSD cards, you can also insert one now to \nexpand storage. Carefully push the tray back in until it clicks into place. If your \nphone supports eSIM technology, you can skip this step and activate the eSIM later in\nthe setup process.\nPower On the Device\nPress and hold the power button for a few seconds until the manufacturer’s logo \nappears on the screen. If the phone doesn’t turn on, check whether the battery is low\n—plug it into the charger and let it charge for at least 15 minutes before trying again. \nIf the phone still does not power on, inspect the charger and cable by testing them \nwith another device. Once powered on, wait for the phone’s startup sequence to \ncomplete before moving on to the next step.\nChoose Language and Region\nThe first screen will prompt you to select your preferred language and region. This \nsetting determines your keyboard layout, time zone, and some regional features, such \nas currency formats and available apps in the app store. Choosing the correct region \nis important, as some system features may be restricted if set incorrectly. If you travel\nfrequently and need a different regional setting later, you may have to reset the \nphone, so choose carefully at this stage.\nConnect to Wi-Fi or Mobile Network\nTo proceed with the setup, connect your phone to the internet. If you have access to a \nWi-Fi network, select it from the list and enter the password. If you inserted a SIM \ncard earlier, your phone may automatically connect to the mobile network and enable\ndata services. For eSIM users, this is the stage where you can activate your eSIM by \nscanning a QR code or entering the activation details provided by your carrier. If \nthere are any connectivity issues, try moving closer to the router, ensuring the Wi-Fi \npassword is correct, or restarting the phone.\nSign in or Create a Google/Apple ID\nSigning in with your Google Account (Android) or Apple ID (iPhone) is essential to \naccess cloud backups, app stores, and security features. If you already have an \naccount, enter your credentials and proceed. If you have forgotten your password, use\nthe \"Forgot Password\" option to reset it. If you don’t have an account, you can create \none now by following the on-screen instructions. Signing in also enables features \nsuch as Find My Device, which helps track your phone if lost.\nRestore from Backup or Set Up as New\nAt this stage, you’ll be given the option to restore from a backup or set up the phone \nas a new device. If you have a previous backup stored on Google Drive (Android) or \niCloud (iPhone), selecting this option will automatically retrieve your apps, contacts, \nsettings, and photos. If switching from another phone, you might have the option to \ntransfer data wirelessly via a QR code or a transfer cable. If you prefer to start fresh, \nsimply set up the phone as a new device and configure all settings manually. Once \nthis step is complete, the process merges, and all users move forward with security \nsetup.\nSet Up Security and Biometrics\nTo protect your phone, you need to configure a screen lock. Choose a PIN, pattern, or\npassword to secure your device. If your phone supports biometric authentication, you \ncan also enable fingerprint unlock or face recognition for faster access. Follow the \non-screen instructions to scan your fingerprint or face multiple times to ensure \naccurate detection. If security setup is skipped, the phone remains unprotected, and \nanyone can access it—so enabling at least a PIN is recommended.\nInstall Software Updates and Essential Apps\nBefore using your phone, check for pending software updates to ensure you have the \nlatest security patches and features. To do this, navigate to Settings > Software \nUpdate and tap Check for Updates. If an update is available, download and install it \nwhile the phone is still connected to Wi-Fi. After the update, open the Google Play \nStore (Android) or Apple App Store (iPhone) and download essential apps such as \nmessaging apps, social media, email, and productivity tools. If your phone comes \nwith bloatware (pre-installed apps) that you don’t need, go to Settings > Apps to \ndisable or uninstall them.\nFinal Checks and Customization\nNow that the phone is fully set up, perform some final checks to ensure everything \nworks correctly. Make a test call to verify that the SIM card is activated, send a text \nmessage, and check that mobile data and Wi-Fi connections are stable. Open the \ncamera app and take a photo to confirm that both the front and rear cameras function \nproperly. Play a video or song to test the speakers and microphone. If biometric \nsecurity was set up earlier, try unlocking the phone using a fingerprint or facial \nrecognition to ensure",
    "chunk_order_index": 0,
    "full_doc_id": "doc-e78ca5b1c6cd91ddcd4c08d7e0129221"
  },
  "chunk-1d2ebb47268dfcae2a5b79b0b5de4a52": {
    "tokens": 252,
    "content": "perform some final checks to ensure everything \nworks correctly. Make a test call to verify that the SIM card is activated, send a text \nmessage, and check that mobile data and Wi-Fi connections are stable. Open the \ncamera app and take a photo to confirm that both the front and rear cameras function \nproperly. Play a video or song to test the speakers and microphone. If biometric \nsecurity was set up earlier, try unlocking the phone using a fingerprint or facial \nrecognition to ensure it responds accurately.\nAfter verifying that all functions are working, personalize your phone by adjusting \nsettings such as brightness, enabling dark mode, changing notification sounds, and \nsetting up widgets like a clock or weather updates. Organize your home screen by \nmoving frequently used apps into folders for easier access. Finally, review privacy \nand security settings, enabling Find My Device in case your phone is lost and \nactivating automatic backups to prevent data loss.\nWith everything configured, your phone is now fully set up and ready to use! If any \nminor issues arise, a simple restart can resolve most problems. Whether you restored \nfrom a backup or started fresh, your device is now optimized for your needs, and \nyou’re ready to enjoy all its features.",
    "chunk_order_index": 1,
    "full_doc_id": "doc-e78ca5b1c6cd91ddcd4c08d7e0129221"
  }
}