{
  "doc-7e08e9385cc851bcd8b6b30fb318d160": {
    "content": "How to Set Up a Dual Boot System (Windows + Ubuntu) the Right Way (11 Steps Total)\nInstalling a dual-boot system with Windows and Ubuntu gives you the flexibility to switch between \ntwo powerful operating systems on the same machine. While the process is manageable, it must be \ndone carefully to avoid data loss or boot issues. This guide walks you through the process from \npreparation to post-installation testing.\nUnderstand BIOS/UEFI and Secure Boot Settings\nBefore you begin downloading or partitioning anything, it’s important to understand how your \nsystem boots. Most modern computers use UEFI, while older systems use the traditional BIOS. \nThis matters because Ubuntu handles UEFI and BIOS booting differently. Restart your computer \nand enter the firmware settings by pressing a designated key during boot-up, such as F2, DEL, or \nESC. Inside the settings menu, check if Secure Boot is enabled. Secure Boot prevents unauthorized \noperating systems from loading and can interfere with Ubuntu’s installation. If your Ubuntu version\nsupports Secure Boot, you can leave it on, otherwise disable it temporarily during installation. Also \ncheck that your system is set to boot in UEFI mode rather than Legacy mode, as this ensures \nsmoother compatibility with both Windows and Ubuntu on the same drive.\nBack Up Your Data\nBefore making any changes to your system, it’s essential to back up all of your important data. \nCopy your documents, photos, and work-related files to an external hard drive or a cloud storage \nservice. Dual booting involves resizing partitions and modifying boot settings, which can \noccasionally go wrong. Having a backup ensures you can recover your information in the event of \naccidental deletion or disk corruption. Do not skip this step even if you feel confident—the risk is \nsmall but never zero.\nCheck Windows System Requirements and Disk Space\nNext, ensure your current Windows system has enough free disk space to accommodate Ubuntu. \nOpen File Explorer, right-click your main hard drive (usually C:), and select Properties. Ubuntu \nrequires at least 20 GB of space, but 50 GB or more is recommended for practical use. Then, press \nWin + R, type “msinfo32,” and press Enter. This opens the system summary window. Look for the \n“BIOS Mode” field—if it says UEFI, your system is using modern firmware, which is ideal. If it \nsays Legacy, the setup process will be slightly different but still possible.\nCreate a Partition for Ubuntu\nTo make space for Ubuntu, open Windows Disk Management by pressing Win + X and choosing \n“Disk Management.” Find your main drive, right-click it, and choose “Shrink Volume.” Specify the \namount of space you want to shrink—usually at least 50,000 MB for 50 GB. After shrinking, you \nwill see a new section labeled “Unallocated.” This space will be used by Ubuntu during installation.\nDo not format or assign a drive letter to it in Windows.\nDownload Ubuntu and Create a Bootable USB Drive\nVisit ubuntu.com and download the latest LTS (Long Term Support) version of Ubuntu. Save the \nISO file to your computer. Next, download Rufus or another USB writing tool. Insert a USB drive \nwith at least 4 GB of space and open Rufus. Select the ISO file and make sure the partition scheme \nmatches your system (GPT for UEFI). Click Start and wait for the process to finish. When it’s done,\nsafely eject the USB drive.\nBoot from the USB Drive\nInsert the bootable USB into your computer and restart it. Enter the boot menu by pressing the \nappropriate key (F12, F2, ESC, or DEL, depending on your system) and select your USB device. If \nyou see two USB options, choose the one marked UEFI. The Ubuntu boot menu will load, giving \nyou the option to try Ubuntu or install it directly. Select “Install Ubuntu” to begin the installation \nprocess.\nBegin the Installation Process\nThe Ubuntu installer will guide you through selecting your language, keyboard layout, and whether \nto download updates or third-party software during installation. When asked how you want to \ninstall Ubuntu, you’ll likely see the option “Install Ubuntu alongside Windows Boot Manager.” \nChoose this option if available, as it simplifies the process. If it’s not shown, choose “Something \nElse” to manually assign the unallocated space to Ubuntu. In the partition editor, create a root \npartition (mount point “/”) using the unallocated space. You may also create a swap partition if \ndesired, though Ubuntu handles swap files automatically on newer systems.\nSet Up User Details and Finalize Installation\nYou’ll be asked to create a user account, set a password, and name your computer. You can choose \nwhether to log in automatically or require a password at each login. After entering these details, the \ninstaller will begin copying files to your system. This process can take anywhere from 10 to 30 \nminutes depending on your hardware. When the installation is complete, you will be prompted to \nremove your USB drive and reboot the system.\nTest GRUB and Boot Both Systems\nOn reboot, the GRUB bootloader menu will appear, allowing you to choose between Ubuntu and \nWindows. Use the arrow keys to select the system you want to boot into. Start by testing Ubuntu to \nensure the installation was successful. Check your Wi-Fi, display resolution, and software settings. \nThen reboot and select Windows to verify that your existing data and programs are still intact. If \nGRUB does not appear and your system boots directly into Windows, you may need to enter your \nBIOS and set Ubuntu as the default boot device.\nTroubleshoot Boot Issues if Necessary\nIf Ubuntu boots but Windows does not appear in the GRUB menu, boot into Ubuntu and open a \nterminal. Run the command “sudo update-grub” and reboot. GRUB will scan for all available \noperating systems and should add Windows automatically. If your computer still does not show the \nboot menu, double-check your BIOS boot order or consider using a tool like Boot-Repair from a \nlive Ubuntu session. Avoid making changes unless you’re sure what they do, as incorrect bootloader\nmodifications can make both systems unbootable.\nMaintain Your Dual Boot Setup\nNow that both systems are installed and working, it’s important to keep them updated. In Windows, \ncontinue using Windows Update as usual. In Ubuntu, open the terminal and run “sudo apt update \n&& sudo apt upgrade” regularly. If you ever need to remove Ubuntu, you must delete its partitions \nand restore the Windows bootloader, which requires using a Windows recovery drive or bootable \nmedia. Likewise, if you upgrade to a new version of Windows, it might overwrite the GRUB \nbootloader—so always have a live Ubuntu USB handy just in case you need to repair the boot menu\nagain.\nWith your dual boot system complete and stable, you now have the flexibility to switch between \nWindows for daily use and Ubuntu for development, experimentation, or open-source tools. \nRemember to back up both systems periodically and stay informed on updates for both platforms."
  }
}